GroupBy in Pandas

In [1]:
import pandas as pd
import numpy as np

In [2]:
data = {
    "name": ["aman", "Saurav", "karan", "Shubham", "abhishek", None, "Sameer"],
    "age": [22, 23, None, 22, 25, 24, 26],
    "marks": [85, None, 88, 90, 56, 72, None],
    "subject": ["math", "physics", "math", "chemistry", "math", "physics", "chemistry"]
}

df = pd.DataFrame(data)
print(df)

       name   age  marks    subject
0      aman  22.0   85.0       math
1    Saurav  23.0    NaN    physics
2     karan   NaN   88.0       math
3   Shubham  22.0   90.0  chemistry
4  abhishek  25.0   56.0       math
5       NaN  24.0   72.0    physics
6    Sameer  26.0    NaN  chemistry

In [3]:
#basic groupby
df.groupby('subject')['marks'].mean()

subject
chemistry    90.000000
math         76.333333
physics      72.000000
Name: marks, dtype: float64

In [4]:
df.groupby('subject')['name'].count() #count students per subject

subject
chemistry    2
math         3
physics      1
Name: name, dtype: int64

In [5]:
#Multiple Aggregations
df.groupby('subject')['marks'].agg(['mean','max','min'])

                mean   max   min
subject
chemistry  90.000000  90.0  90.0
math       76.333333  88.0  56.0
physics    72.000000  72.0  72.0

In [6]:
df.groupby('subject')['marks'].agg(['mean','max','min','count'])

                mean   max   min  count
subject
chemistry  90.000000  90.0  90.0      1
math       76.333333  88.0  56.0      3
physics    72.000000  72.0  72.0      1

In [7]:
#Group by multiple columns 
df.groupby(['subject','age'])['marks'].mean()

subject    age
chemistry  22.0    90.0
           26.0     NaN
math       22.0    85.0
           25.0    56.0
physics    23.0     NaN
           24.0    72.0
Name: marks, dtype: float64